#Область СлужебныеПроцедурыИФункции
Процедура АктуализироватьЦены() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КнигиТовары.Ссылка.Родитель КАК Родитель,
	|	КнигиТовары.Ссылка.НомерКниги КАК НомерКниги,
	|	КнигиТовары.Ссылка КАК Книга,
	|	КнигиТовары.Магазин КАК Магазин,
	|	КнигиТовары.ТипКниги КАК ТипКниги,
	|	КнигиТовары.Гиперссылка КАК Гиперссылка
	|ИЗ
	|	Справочник.Книги.Товары КАК КнигиТовары
	|ГДЕ
	|	НЕ КнигиТовары.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Родитель,
	|	НомерКниги,
	|	Книга,
	|	Магазин,
	|	ТипКниги,
	|	Гиперссылка";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		// Стоит защита, код обернут в js
		Если Выборка.Магазин = Справочники.Магазины.OZON Или Выборка.Магазин = Справочники.Магазины.СберМегаМаркет Тогда
			
			Продолжить;
			
		КонецЕсли;

		Цена = ПариснгЦенСервер.ПолучитьЦену(Выборка.Магазин, Выборка.Гиперссылка);

		Если Цена <= 0 Тогда

			Текст = СтрШаблон("Ошибка получения цены: %1", Выборка.Гиперссылка);
			ОбщегоНазначения.ОтправитьСообщениеВТелеграмм(Справочники.ЧатыТелеграмм.Себе.Код, Текст);
			Продолжить;

		КонецЕсли;
		
		Отбор = Новый Структура("Книга, Магазин, ТипКниги");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);

		СтруктураРесурсов = РегистрыСведений.Цены.ПолучитьПоследнее( , Отбор);

		ПоследняяЦена = СтруктураРесурсов.Цена;
		
		Если Цена <> ПоследняяЦена Тогда

			МенеджерЗаписи = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Цена = Цена;
			МенеджерЗаписи.Записать();

			Текст = ПолучитьТекст(Выборка, ПоследняяЦена, Цена);
			ОбщегоНазначения.ОтправитьСообщениеВТелеграмм(Справочники.ЧатыТелеграмм.Трио.Код, Текст);

		КонецЕсли;

	КонецЦикла;

//	СохранитьФайлНаФТП();

КонецПроцедуры

Функция ПолучитьТекст(Выборка, ПоследняяЦена, Цена)

	Текст = СтрШаблон("‼ У %1 [%2] на %3 изменилась цена с %4 на %5",
					  Выборка.Книга,
					  Выборка.ТипКниги,
					  Выборка.Магазин,
					  ПоследняяЦена,
					  Цена);

	Возврат Текст;

КонецФункции

Процедура СохранитьФайлНаФТП()
КонецПроцедуры
#КонецОбласти