#Область СлужебныеПроцедурыИФункции

Процедура АктуализироватьЦены() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КнигиТовары.Ссылка.Родитель КАК Родитель,
	|	КнигиТовары.Ссылка.НомерКниги КАК НомерКниги,
	|	КнигиТовары.Ссылка КАК Книга,
	|	КнигиТовары.Магазин КАК Магазин,
	|	КнигиТовары.ТипКниги КАК ТипКниги,
	|	КнигиТовары.Гиперссылка КАК Гиперссылка
	|ИЗ
	|	Справочник.Книги.Товары КАК КнигиТовары
	|ГДЕ
	|	НЕ КнигиТовары.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Родитель,
	|	НомерКниги,
	|	Книга,
	|	Магазин,
	|	ТипКниги,
	|	Гиперссылка";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Цена = ПариснгЦенСервер.ПолучитьЦену(Выборка.Магазин, Выборка.Гиперссылка);

		Отбор = Новый Структура("Книга, Магазин, ТипКниги");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);

		СтруктураРесурсов = РегистрыСведений.Цены.ПолучитьПоследнее( , Отбор);

		ПоследняяЦена = СтруктураРесурсов.Цена;

		Если Цена = -1 Тогда

			Текст = СтрШаблон("Ошибка получения цены: %1", Выборка.Гиперссылка);
			
			// Себе	
			chat_id = "113833338";

			ОтправитьСообщениеВТелеграмм(chat_id, Текст);

		ИначеЕсли Цена <> ПоследняяЦена Тогда

			МенеджерЗаписи = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Цена = Цена;
			МенеджерЗаписи.Записать();

			Текст = ПолучитьТекст(Выборка, ПоследняяЦена, Цена);
			
			// В группу	
			chat_id = "-1001763722348";

			ОтправитьСообщениеВТелеграмм(chat_id, Текст);

		КонецЕсли;

	КонецЦикла;

	СохранитьФайлНаФТП();

КонецПроцедуры

Функция ПолучитьТекст(Выборка, ПоследняяЦена, Цена)

	Текст = СтрШаблон("‼ У %1 [%2] на %3 изменилась цена с %4 на %5", Выборка.Книга, Выборка.ТипКниги, Выборка.Магазин,
		ПоследняяЦена, Цена);

	Возврат Текст;

КонецФункции

Процедура ОтправитьСообщениеВТелеграмм(chat_id, Текст)

	Гиперссылка = СтрШаблон(
		"https://api.telegram.org/bot5428294780:AAEuJw-2ZA2C3ytOWoX4RLS1yjCm6d1RVJY/sendMessage?chat_id=%1&text=%2",
		chat_id, Текст);

	КодСтраницы = ПариснгЦенСервер.ПолучитьКодСтраницы(Гиперссылка);

КонецПроцедуры

Процедура СохранитьФайлНаФТП()
КонецПроцедуры

#КонецОбласти