#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)

	ЗаполнитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)

	ЗаписатьНаСервере();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()

	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.Заполнить();

	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	Для Каждого Книга Из Объект.Книги Цикл

		КнигаОбъект = Книга.Ссылка.ПолучитьОбъект();
		КнигаОбъект.ПорядокДляСайта = Книга.НомерСтроки;
		КнигаОбъект.Записать();

	КонецЦикла;

КонецПроцедуры
#КонецОбласти