
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.Заполнить();
	
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Для Каждого Книга Из Объект.Книги Цикл
		
		КнигаОбъект = Книга.Ссылка.ПолучитьОбъект();
		КнигаОбъект.ПорядокДляСайта = Книга.НомерСтроки;
		КнигаОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры

