

#Область СлужебныеПроцедурыИФункции
Функция ВернутьТолькоЧисла(Знач ТекстовоеСодержимое) Экспорт

	ДлинаСтроки = СтрДлина(ТекстовоеСодержимое);

	ЦенаСтрокой = "";

	Для Индекс = 1 По ДлинаСтроки Цикл

		Символ = Сред(ТекстовоеСодержимое, Индекс, 1);

		Если Символ = "," Тогда

			Прервать;

		КонецЕсли;

		Если Найти("0123456789", Символ) Тогда

			ЦенаСтрокой = ЦенаСтрокой + Символ;

		КонецЕсли;

	КонецЦикла;
	
	Если ПустаяСтрока(ЦенаСтрокой) Тогда
		
		Возврат 0;
		
	Иначе
		
		Возврат Число(ЦенаСтрокой);
		
	КонецЕсли;

КонецФункции

Процедура ЗаполнитьЦену(Цена, Магазин, Гиперссылка, ЦеныГиперссылка) Экспорт

	НайденнаяЦена = Неопределено;

	ЧтениеHTML = Новый ЧтениеHTML;
	ИмяФайла = Сред(Гиперссылка, 9);
	ИмяФайла = СтрЗаменить(ИмяФайла, ".", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "/", "_");
	ИмяФайла = СтроковыеФункции.СтрокаЛатиницей(ИмяФайла);
	ЧтениеHTML.ОткрытьФайл(СтрШаблон("/Users/plotnikov1c/html/pages/%1", ИмяФайла), "UTF-8");

	ОбъектыDOM = Новый ПостроительDOM;

	ДокументHTML = ОбъектыDOM.Прочитать(ЧтениеHTML);
	ЧтениеHTML.Закрыть();

	СчетчикОбхода = 0;

	Пока НайденнаяЦена = Неопределено И СчетчикОбхода >= 0 Цикл

		СчетчикОбхода = СчетчикОбхода + 1;

		ОбойтиDOM(НайденнаяЦена, ДокументHTML, Магазин, СчетчикОбхода);

		Если НайденнаяЦена <> Неопределено И (Цена = -1 Или НайденнаяЦена < Цена) Тогда

			Цена = НайденнаяЦена;
			ЦеныГиперссылка = Гиперссылка;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ОбойтиDOM(Цена, ДокументHTML, Магазин, СчетчикОбхода)
	
	Если Магазин = Справочники.Магазины.COMBOOK Тогда

		Цена = ВернутьТолькоЧисла(ДокументHTML.ПолучитьЭлементПоИдентификатору("product_price").ТекстовоеСодержимое);

	Иначе

		СтрокиПоиска = ПолучитьСтрокиПоиска(Магазин, СчетчикОбхода);

		ЭлементыDOM  = ДокументHTML.ПолучитьЭлементыПоИмени(СтрокиПоиска.ИмяЭлемента);
		
		Для Каждого ЭлементDOM Из ЭлементыDOM Цикл

			Если Магазин = Справочники.Магазины.OZON Тогда
				
				Если СтрДлина(ЭлементDOM.ИмяКласса) = 7 Тогда
					
					НайденнаяЦена = ВернутьТолькоЧисла(ЭлементDOM.ТекстовоеСодержимое);
					
					Если НайденнаяЦена > 0 Тогда
						
						Цена = НайденнаяЦена;
						Прервать;
						
					КонецЕсли;
					
				КонецЕсли;	
				
			Иначе
				
				Если ЭлементDOM.ИмяКласса = СтрокиПоиска.ИмяКласса Тогда

					НайденнаяЦена = ВернутьТолькоЧисла(ЭлементDOM.ТекстовоеСодержимое);

					Если Цена = Неопределено Тогда

						Цена = НайденнаяЦена;

					Иначе

						Цена = Мин(Цена, НайденнаяЦена);
						Прервать;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтрокиПоиска(Магазин, СчетчикОбхода)

	Если Магазин = Справочники.Магазины.ЛитРес И СчетчикОбхода = 1 Тогда

		ИмяЭлемента = "span";
		ИмяКласса   = "simple-price";

	ИначеЕсли Магазин = Справочники.Магазины.ПризрачныеМиры И СчетчикОбхода = 1 Тогда

		ИмяЭлемента = "span";
		ИмяКласса   = "pull-left";

	ИначеЕсли Магазин = Справочники.Магазины.Bookriver И СчетчикОбхода = 1 Тогда // парсит две цены, обычную и со скидкой

		ИмяЭлемента = "span";
		ИмяКласса   = "s1nq5ky_SCPrice";

	ИначеЕсли Магазин = Справочники.Магазины.Литмаркет И СчетчикОбхода = 1 Тогда

		ИмяЭлемента = "div";
		ИмяКласса   = "btn btn-success price-btn";

	ИначеЕсли Магазин = Справочники.Магазины.Лабиринт И СчетчикОбхода = 1 Тогда

		ИмяЭлемента = "span";
		ИмяКласса   = "buying-pricenew-val-number";

	ИначеЕсли Магазин = Справочники.Магазины.ЧитайГород И СчетчикОбхода = 1 Тогда

		ИмяЭлемента = "div";
		ИмяКласса   = "price";

	ИначеЕсли Магазин = Справочники.Магазины.Буквоед И СчетчикОбхода = 1 Тогда

		ИмяЭлемента = "div";
		ИмяКласса   = "oD";
	
	ИначеЕсли Магазин = Справочники.Магазины.Буквоед И СчетчикОбхода = 2 Тогда

		ИмяЭлемента = "div";
		ИмяКласса   = "qD";

	ИначеЕсли Магазин = Справочники.Магазины.Book24 И СчетчикОбхода = 1 Тогда

		ИмяЭлемента = "span";
		ИмяКласса   = "app-price product-sidebar-price__price";
		
	ИначеЕсли Магазин = Справочники.Магазины.OZON И СчетчикОбхода = 1 Тогда
		
		ИмяЭлемента = "span";
		ИмяКласса   = "nv1 n1v";
		
	ИначеЕсли Магазин = Справочники.Магазины.СберМегаМаркет И СчетчикОбхода = 1 Тогда
		
		ИмяЭлемента = "span";
		ИмяКласса   = "pdp-sales-block__price-final";
		
	ИначеЕсли Магазин = Справочники.Магазины.Wildberries И СчетчикОбхода = 1 Тогда
		
		ИмяЭлемента = "ins";
		ИмяКласса   = "price-block__final-price";
		
	ИначеЕсли Магазин = Справочники.Магазины.COMBOOK И СчетчикОбхода = 1 Тогда
		
		ИмяЭлемента = "div";
		ИмяКласса   = "product_price";
		
	ИначеЕсли Магазин = Справочники.Магазины.СимаЛенд И СчетчикОбхода = 1 Тогда
		
		ИмяЭлемента = "span";
		ИмяКласса   = "LTJlA vxQd2";
		
	ИначеЕсли Магазин = Справочники.Магазины.Майшоп И СчетчикОбхода = 1 Тогда
		
		ИмяЭлемента = "div";
		ИмяКласса   = "price__base price-red";

	Иначе

		ИмяЭлемента   = "";
		ИмяКласса     = "";
		СчетчикОбхода = -1;

	КонецЕсли;

	Возврат Новый Структура("ИмяЭлемента, ИмяКласса", ИмяЭлемента, ИмяКласса);

КонецФункции
#КонецОбласти