#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТоварыПередУдалениемНаСервере(Объект.Ссылка, ТекущиеДанные.ТипКниги, ТекущиеДанные.Магазин);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Товары перед удалением на сервере.
// 
// Параметры:
//  Книга - СправочникСсылка.Книги - Книга
//  ТипКниги - ПеречислениеСсылка.ТипКниги - Тип книги
//  Магазин - СправочникСсылка.Магазины - Магазин
&НаСервереБезКонтекста
Процедура ТоварыПередУдалениемНаСервере(Книга, ТипКниги, Магазин)

	РегистрыСведений.Цены.Удалить(Книга, ТипКниги, Магазин);

КонецПроцедуры
#КонецОбласти