#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТоварыПередУдалениемНаСервере(Объект.Ссылка, ТекущиеДанные.ТипКниги, ТекущиеДанные.Магазин);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Товары перед удалением на сервере.
// 
// Параметры:
//  Книга - СправочникСсылка.Книги - Книга
//  ТипКниги - ПеречислениеСсылка.ТипКниги - Тип книги
//  Магазин - СправочникСсылка.Магазины - Магазин
&НаСервереБезКонтекста
Процедура ТоварыПередУдалениемНаСервере(Книга, ТипКниги, Магазин)

	Если ЗначениеЗаполнено(Книга) И ЗначениеЗаполнено(ТипКниги) И ЗначениеЗаполнено(Магазин) Тогда

		НаборЗаписей = РегистрыСведений.Цены.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Книга.Установить(Книга);
		НаборЗаписей.Отбор.ТипКниги.Установить(ТипКниги);
		НаборЗаписей.Отбор.Магазин.Установить(Магазин);
		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры
#КонецОбласти