#Область СлужебныеПроцедурыИФункции
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	// Удалить.
	// 
	// Параметры:
	//  Книга - СправочникСсылка.Книги - Книга
	//  ТипКниги - ПеречислениеСсылка.ТипКниги - Тип книги
	//  Магазин - СправочникСсылка.Магазины - Магазин
	Процедура Удалить(Книга, ТипКниги, Магазин) Экспорт

		Если ЗначениеЗаполнено(Книга) И ЗначениеЗаполнено(ТипКниги) И ЗначениеЗаполнено(Магазин) Тогда

			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Книга.Установить(Книга);
			НаборЗаписей.Отбор.ТипКниги.Установить(ТипКниги);
			НаборЗаписей.Отбор.Магазин.Установить(Магазин);
			НаборЗаписей.Записать();

		КонецЕсли;

	КонецПроцедуры
#КонецЕсли
#КонецОбласти